# CannotCreateModeltext Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TextFailures..::..CannotCreateModeltext Property
BuiltInFailures..::..TextFailures Class See Also
---
Can't create Model Text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateModeltext { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateModeltext As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateModeltext {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TextFailures Class
Autodesk.Revit.DB Namespace